       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           COPIER. 

       ENVIRONMENT DIVISION.
           INPUT-OUTPUT SECTION.
           FILE-CONTROL.
               SELECT CARD-IN-FILE ASSIGN TO UT-S-CARDS.
               SELECT LINE-OUT-FILE ASSIGN TO UT-S-PRINTER.

       DATA DIVISION.
           FILE SECTION.
           FD CARD-IN-FILE
               LABEL RECORDS ARE OMITTED.
           01 CARD-IN-RECORD PICTURE X(80).
           FD LINE-OUT-FILE
               LABEL RECORDS ARE OMITTED.
           01 LINE-OUT-RECORD PICTURE X(80).
           WORKING-STORAGE SECTION.
           01 OUT-OF-CARDS-FLAG PICTURE XXX.

       PROCEDURE DIVISION.
           MAIN-LINE-ROUTINE.
           OPEN INPUT CARD-IN-FILE
                OUTPUT LINE-OUT-FILE.
           MOVE 'NO' TO OUT-OF-CARDS-FLAG.
           READ CARD-IN-FILE
               AT END MOVE 'YES' TO OUT-OF-CARDS-FLAG.
           PERFORM PROCESS-WRITE-READ-PARAGRAPH
               UNTIL OUT-OF-CARDS-FLAG = 'YES'.
           CLOSE CARD-IN-FILE LINE-OUT-FILE.
           STOP RUN. 

       PROCESS-WRITE-READ-PARAGRAPH.
           MOVE CARD-IN-RECORD TO LINE-OUT-RECORD.
           WRITE LINE-OUT-RECORD.
           READ CARD-IN-FILE
               AT END HOVE 'YES' TO OUT-OF-CARDS-FLAG. 
